# Создайте скрипт func и функцию чтения последней
# строки файла, вызовите ее из скрипта example

# import example

# example.ReadLastRow()

# Создайте файл с числами на каждой строке
# Создаем скрипт, который выведет сначала
# числа с четных строк, потом с нечетных

# import example2

# example2.Number()

# При работе с документацией менеджер 
# допустил ошибку, название товаров 
# перемешались с ценами. Помогите восстановить 
# документ. Порядковый номер товара совпадает 
# с номером цены

# import example3

# example3.Exercise()

# Создайте генератор паролей и выведите скрипт 
# в файл password.txt

# import example4

# example4.Paroles()

# Создайте словарь из символов из файла с текстом

# import example5

# example5.Dictionary()