# Дано число N. Найдите площадь круга с
# радиусом N. Ответ округлите до сотых
import math

radius = 15
print(round(math.pi * math.pow(radius, 2), 2))